MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4MNFYAFG/mcu.h
/**
  * @brief Flash Memory Interface (FC)
  */
typedef struct
{
       uint32_t RESERVED0[4];
  __IO uint32_t SBMR;              /*!< Flash Security Bit Mask Register             */
  __I  uint32_t SSR;               /*!< Flash Security Status Register               */
  __O  uint32_t KCR;               /*!< Flash Key Code Register                      */
       uint32_t RESERVED1;
  __I  uint32_t SR0;               /*!< Flash Status Register 0                      */
       uint32_t RESERVED2[3];
  __I  uint32_t PSR0;              /*!< Flash Protect Status Register 0              */
  __I  uint32_t PSR1;              /*!< Flash Protect Status Register 1              */
       uint32_t RESERVED3[4];
  __I  uint32_t PSR6;              /*!< Flash Protect Status Register 6              */
       uint32_t RESERVED4;
  __IO uint32_t PMR0;              /*!< Flash Protect Mask Register 0                */
  __IO uint32_t PMR1;              /*!< Flash Protect Mask Register 1                */
       uint32_t RESERVED5[4];
  __IO uint32_t PMR6;              /*!< Flash Protect Mask Register 6                */
       uint32_t RESERVED6[37];
  __I  uint32_t SR1;               /*!< Flash Status Register 1                      */
  __I  uint32_t SWPSR;             /*!< Flash Memory SWAP Status Register            */
       uint32_t RESERVED7[14];
  __IO uint32_t AREASEL;           /*!< Flash Area Selection Register                */
       uint32_t RESERVED8;
  __IO uint32_t CR;                /*!< Flash Control Register                       */
  __IO uint32_t STSCLR;            /*!< Flash Status Clear Register                  */
  __IO uint32_t BNKCR;             /*!< Flash Bank Change Register                   */
  __IO uint32_t FCACCR;            /*!< Flash Access Control Register                */
  __IO uint32_t BUFDISCLR;         /*!< Flash Buffer Disable and Clear Register      */
} TSB_FC_TypeDef;


/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_CANAMB0_BASE           (PERI_BASE  + 0x0005000UL)
#define TSB_CANAMB1_BASE           (PERI_BASE  + 0x0005020UL)
#define TSB_CANAMB2_BASE           (PERI_BASE  + 0x0005040UL)
#define TSB_CANAMB3_BASE           (PERI_BASE  + 0x0005060UL)
#define TSB_CANAMB4_BASE           (PERI_BASE  + 0x0005080UL)
#define TSB_CANAMB5_BASE           (PERI_BASE  + 0x00050A0UL)
#define TSB_CANAMB6_BASE           (PERI_BASE  + 0x00050C0UL)
#define TSB_CANAMB7_BASE           (PERI_BASE  + 0x00050E0UL)
#define TSB_CANAMB8_BASE           (PERI_BASE  + 0x0005100UL)
#define TSB_CANAMB9_BASE           (PERI_BASE  + 0x0005120UL)
#define TSB_CANAMB10_BASE          (PERI_BASE  + 0x0005140UL)
#define TSB_CANAMB11_BASE          (PERI_BASE  + 0x0005160UL)
#define TSB_CANAMB12_BASE          (PERI_BASE  + 0x0005180UL)
#define TSB_CANAMB13_BASE          (PERI_BASE  + 0x00051A0UL)
#define TSB_CANAMB14_BASE          (PERI_BASE  + 0x00051C0UL)
#define TSB_CANAMB15_BASE          (PERI_BASE  + 0x00051E0UL)
#define TSB_CANAMB16_BASE          (PERI_BASE  + 0x0005200UL)
#define TSB_CANAMB17_BASE          (PERI_BASE  + 0x0005220UL)
#define TSB_CANAMB18_BASE          (PERI_BASE  + 0x0005240UL)
#define TSB_CANAMB19_BASE          (PERI_BASE  + 0x0005260UL)
#define TSB_CANAMB20_BASE          (PERI_BASE  + 0x0005280UL)
#define TSB_CANAMB21_BASE          (PERI_BASE  + 0x00052A0UL)
#define TSB_CANAMB22_BASE          (PERI_BASE  + 0x00052C0UL)
#define TSB_CANAMB23_BASE          (PERI_BASE  + 0x00052E0UL)
#define TSB_CANAMB24_BASE          (PERI_BASE  + 0x0005300UL)
#define TSB_CANAMB25_BASE          (PERI_BASE  + 0x0005320UL)
#define TSB_CANAMB26_BASE          (PERI_BASE  + 0x0005340UL)
#define TSB_CANAMB27_BASE          (PERI_BASE  + 0x0005360UL)
#define TSB_CANAMB28_BASE          (PERI_BASE  + 0x0005380UL)
#define TSB_CANAMB29_BASE          (PERI_BASE  + 0x00053A0UL)
#define TSB_CANAMB30_BASE          (PERI_BASE  + 0x00053C0UL)
#define TSB_CANAMB31_BASE          (PERI_BASE  + 0x00053E0UL)
#define TSB_CANA_BASE              (PERI_BASE  + 0x0005400UL)
#define TSB_IA_BASE                (PERI_BASE  + 0x003E000UL)
#define TSB_RLM_BASE               (PERI_BASE  + 0x003E400UL)
#define TSB_LVD_BASE               (PERI_BASE  + 0x003EC00UL)
#define TSB_RPAR0_BASE             (PERI_BASE  + 0x0043000UL)
#define TSB_RPAR1_BASE             (PERI_BASE  + 0x00A3000UL)
#define TSB_CRC_BASE               (PERI_BASE  + 0x0043100UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x0083000UL)
#define TSB_IB_BASE                (PERI_BASE  + 0x0083200UL)
#define TSB_IMN_BASE               (PERI_BASE  + 0x0083300UL)
#define TSB_DNFA_BASE              (PERI_BASE  + 0x00A0200UL)
#define TSB_DNFB_BASE              (PERI_BASE  + 0x00A0300UL)
#define TSB_DNFC_BASE              (PERI_BASE  + 0x00A0800UL)
#define TSB_TSEL0_BASE             (PERI_BASE  + 0x00A0400UL)
#define TSB_SIWD0_BASE             (PERI_BASE  + 0x00A0600UL)
#define TSB_NBD_BASE               (PERI_BASE  + 0x00A2000UL)
#define TSB_DMAA_BASE              (PERI_BASE  + 0x00A4000UL)
#define TSB_ADA_BASE               (PERI_BASE  + 0x00BA000UL)
#define TSB_ADB_BASE               (PERI_BASE  + 0x00BA400UL)
#define TSB_ADC_BASE               (PERI_BASE  + 0x00BA800UL)
#define TSB_AMP_BASE               (PERI_BASE  + 0x00BD000UL)
#define TSB_T32A0_BASE             (PERI_BASE  + 0x00C1000UL)
#define TSB_T32A1_BASE             (PERI_BASE  + 0x00C1400UL)
#define TSB_T32A2_BASE             (PERI_BASE  + 0x00C1800UL)
#define TSB_T32A3_BASE             (PERI_BASE  + 0x00C1C00UL)
#define TSB_T32A4_BASE             (PERI_BASE  + 0x00C2000UL)
#define TSB_T32A5_BASE             (PERI_BASE  + 0x00C2400UL)
#define TSB_TSPI0_BASE             (PERI_BASE  + 0x00CA000UL)
#define TSB_TSPI1_BASE             (PERI_BASE  + 0x00CA400UL)
#define TSB_UART0_BASE             (PERI_BASE  + 0x00CE000UL)
#define TSB_UART1_BASE             (PERI_BASE  + 0x00CE400UL)
#define TSB_UART2_BASE             (PERI_BASE  + 0x00CE800UL)
#define TSB_UART3_BASE             (PERI_BASE  + 0x00CEC00UL)
#define TSB_I2C0_BASE              (PERI_BASE  + 0x00D1000UL)
#define TSB_I2C1_BASE              (PERI_BASE  + 0x00D2000UL)
#define TSB_EI2C0_BASE             (PERI_BASE  + 0x00D8000UL)
#define TSB_EI2C1_BASE             (PERI_BASE  + 0x00D9000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00E0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00E0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00E0200UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00E0300UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00E0400UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00E0500UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00E0600UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00E0700UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x00E0800UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00E0900UL)
#define TSB_PL_BASE                (PERI_BASE  + 0x00E0A00UL)
#define TSB_PM_BASE                (PERI_BASE  + 0x00E0B00UL)
#define TSB_PN_BASE                (PERI_BASE  + 0x00E0C00UL)
#define TSB_PU_BASE                (PERI_BASE  + 0x00E1000UL)
#define TSB_PV_BASE                (PERI_BASE  + 0x00E1100UL)
#define TSB_TRM_BASE               (PERI_BASE  + 0x00E3100UL)
#define TSB_OFD_BASE               (PERI_BASE  + 0x00E4000UL)
#define TSB_PMD0_BASE              (PERI_BASE  + 0x00E9000UL)
#define TSB_PMD1_BASE              (PERI_BASE  + 0x00E9400UL)
#define TSB_PMD2_BASE              (PERI_BASE  + 0x00E9800UL)
#define TSB_EN0_BASE               (PERI_BASE  + 0x00EA000UL)
#define TSB_EN1_BASE               (PERI_BASE  + 0x00EA400UL)
#define TSB_EN2_BASE               (PERI_BASE  + 0x00EA800UL)
#define TSB_VE0_BASE               (PERI_BASE  + 0x00EB000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1DFF0000UL)


