MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4MNFYAFG/mcu.h
/* CAN Controller (CAN) */
#define TSB_CANA_MC_MC0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,0)))
#define TSB_CANA_MC_MC1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,1)))
#define TSB_CANA_MC_MC2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,2)))
#define TSB_CANA_MC_MC3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,3)))
#define TSB_CANA_MC_MC4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,4)))
#define TSB_CANA_MC_MC5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,5)))
#define TSB_CANA_MC_MC6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,6)))
#define TSB_CANA_MC_MC7                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,7)))
#define TSB_CANA_MC_MC8                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,8)))
#define TSB_CANA_MC_MC9                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,9)))
#define TSB_CANA_MC_MC10                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,10)))
#define TSB_CANA_MC_MC11                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,11)))
#define TSB_CANA_MC_MC12                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,12)))
#define TSB_CANA_MC_MC13                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,13)))
#define TSB_CANA_MC_MC14                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,14)))
#define TSB_CANA_MC_MC15                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,15)))
#define TSB_CANA_MC_MC16                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,16)))
#define TSB_CANA_MC_MC17                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,17)))
#define TSB_CANA_MC_MC18                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,18)))
#define TSB_CANA_MC_MC19                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,19)))
#define TSB_CANA_MC_MC20                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,20)))
#define TSB_CANA_MC_MC21                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,21)))
#define TSB_CANA_MC_MC22                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,22)))
#define TSB_CANA_MC_MC23                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,23)))
#define TSB_CANA_MC_MC24                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,24)))
#define TSB_CANA_MC_MC25                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,25)))
#define TSB_CANA_MC_MC26                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,26)))
#define TSB_CANA_MC_MC27                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,27)))
#define TSB_CANA_MC_MC28                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,28)))
#define TSB_CANA_MC_MC29                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,29)))
#define TSB_CANA_MC_MC30                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,30)))
#define TSB_CANA_MC_MC31                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MC,31)))
#define TSB_CANA_MD_MD0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,0)))
#define TSB_CANA_MD_MD1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,1)))
#define TSB_CANA_MD_MD2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,2)))
#define TSB_CANA_MD_MD3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,3)))
#define TSB_CANA_MD_MD4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,4)))
#define TSB_CANA_MD_MD5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,5)))
#define TSB_CANA_MD_MD6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,6)))
#define TSB_CANA_MD_MD7                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,7)))
#define TSB_CANA_MD_MD8                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,8)))
#define TSB_CANA_MD_MD9                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,9)))
#define TSB_CANA_MD_MD10                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,10)))
#define TSB_CANA_MD_MD11                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,11)))
#define TSB_CANA_MD_MD12                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,12)))
#define TSB_CANA_MD_MD13                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,13)))
#define TSB_CANA_MD_MD14                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,14)))
#define TSB_CANA_MD_MD15                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,15)))
#define TSB_CANA_MD_MD16                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,16)))
#define TSB_CANA_MD_MD17                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,17)))
#define TSB_CANA_MD_MD18                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,18)))
#define TSB_CANA_MD_MD19                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,19)))
#define TSB_CANA_MD_MD20                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,20)))
#define TSB_CANA_MD_MD21                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,21)))
#define TSB_CANA_MD_MD22                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,22)))
#define TSB_CANA_MD_MD23                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,23)))
#define TSB_CANA_MD_MD24                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,24)))
#define TSB_CANA_MD_MD25                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,25)))
#define TSB_CANA_MD_MD26                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,26)))
#define TSB_CANA_MD_MD27                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,27)))
#define TSB_CANA_MD_MD28                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,28)))
#define TSB_CANA_MD_MD29                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,29)))
#define TSB_CANA_MD_MD30                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->MD,30)))
#define TSB_CANA_MD_MD31                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_CANA->MD,31)))
#define TSB_CANA_TRS_TRS0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,0)))
#define TSB_CANA_TRS_TRS1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,1)))
#define TSB_CANA_TRS_TRS2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,2)))
#define TSB_CANA_TRS_TRS3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,3)))
#define TSB_CANA_TRS_TRS4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,4)))
#define TSB_CANA_TRS_TRS5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,5)))
#define TSB_CANA_TRS_TRS6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,6)))
#define TSB_CANA_TRS_TRS7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,7)))
#define TSB_CANA_TRS_TRS8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,8)))
#define TSB_CANA_TRS_TRS9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,9)))
#define TSB_CANA_TRS_TRS10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,10)))
#define TSB_CANA_TRS_TRS11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,11)))
#define TSB_CANA_TRS_TRS12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,12)))
#define TSB_CANA_TRS_TRS13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,13)))
#define TSB_CANA_TRS_TRS14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,14)))
#define TSB_CANA_TRS_TRS15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,15)))
#define TSB_CANA_TRS_TRS16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,16)))
#define TSB_CANA_TRS_TRS17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,17)))
#define TSB_CANA_TRS_TRS18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,18)))
#define TSB_CANA_TRS_TRS19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,19)))
#define TSB_CANA_TRS_TRS20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,20)))
#define TSB_CANA_TRS_TRS21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,21)))
#define TSB_CANA_TRS_TRS22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,22)))
#define TSB_CANA_TRS_TRS23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,23)))
#define TSB_CANA_TRS_TRS24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,24)))
#define TSB_CANA_TRS_TRS25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,25)))
#define TSB_CANA_TRS_TRS26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,26)))
#define TSB_CANA_TRS_TRS27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,27)))
#define TSB_CANA_TRS_TRS28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,28)))
#define TSB_CANA_TRS_TRS29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,29)))
#define TSB_CANA_TRS_TRS30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRS,30)))
#define TSB_CANA_TRR_TRR0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,0)))
#define TSB_CANA_TRR_TRR1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,1)))
#define TSB_CANA_TRR_TRR2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,2)))
#define TSB_CANA_TRR_TRR3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,3)))
#define TSB_CANA_TRR_TRR4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,4)))
#define TSB_CANA_TRR_TRR5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,5)))
#define TSB_CANA_TRR_TRR6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,6)))
#define TSB_CANA_TRR_TRR7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,7)))
#define TSB_CANA_TRR_TRR8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,8)))
#define TSB_CANA_TRR_TRR9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,9)))
#define TSB_CANA_TRR_TRR10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,10)))
#define TSB_CANA_TRR_TRR11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,11)))
#define TSB_CANA_TRR_TRR12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,12)))
#define TSB_CANA_TRR_TRR13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,13)))
#define TSB_CANA_TRR_TRR14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,14)))
#define TSB_CANA_TRR_TRR15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,15)))
#define TSB_CANA_TRR_TRR16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,16)))
#define TSB_CANA_TRR_TRR17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,17)))
#define TSB_CANA_TRR_TRR18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,18)))
#define TSB_CANA_TRR_TRR19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,19)))
#define TSB_CANA_TRR_TRR20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,20)))
#define TSB_CANA_TRR_TRR21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,21)))
#define TSB_CANA_TRR_TRR22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,22)))
#define TSB_CANA_TRR_TRR23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,23)))
#define TSB_CANA_TRR_TRR24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,24)))
#define TSB_CANA_TRR_TRR25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,25)))
#define TSB_CANA_TRR_TRR26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,26)))
#define TSB_CANA_TRR_TRR27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,27)))
#define TSB_CANA_TRR_TRR28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,28)))
#define TSB_CANA_TRR_TRR29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,29)))
#define TSB_CANA_TRR_TRR30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TRR,30)))
#define TSB_CANA_TA_TA0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,0)))
#define TSB_CANA_TA_TA1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,1)))
#define TSB_CANA_TA_TA2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,2)))
#define TSB_CANA_TA_TA3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,3)))
#define TSB_CANA_TA_TA4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,4)))
#define TSB_CANA_TA_TA5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,5)))
#define TSB_CANA_TA_TA6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,6)))
#define TSB_CANA_TA_TA7                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,7)))
#define TSB_CANA_TA_TA8                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,8)))
#define TSB_CANA_TA_TA9                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,9)))
#define TSB_CANA_TA_TA10                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,10)))
#define TSB_CANA_TA_TA11                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,11)))
#define TSB_CANA_TA_TA12                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,12)))
#define TSB_CANA_TA_TA13                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,13)))
#define TSB_CANA_TA_TA14                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,14)))
#define TSB_CANA_TA_TA15                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,15)))
#define TSB_CANA_TA_TA16                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,16)))
#define TSB_CANA_TA_TA17                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,17)))
#define TSB_CANA_TA_TA18                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,18)))
#define TSB_CANA_TA_TA19                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,19)))
#define TSB_CANA_TA_TA20                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,20)))
#define TSB_CANA_TA_TA21                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,21)))
#define TSB_CANA_TA_TA22                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,22)))
#define TSB_CANA_TA_TA23                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,23)))
#define TSB_CANA_TA_TA24                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,24)))
#define TSB_CANA_TA_TA25                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,25)))
#define TSB_CANA_TA_TA26                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,26)))
#define TSB_CANA_TA_TA27                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,27)))
#define TSB_CANA_TA_TA28                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,28)))
#define TSB_CANA_TA_TA29                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,29)))
#define TSB_CANA_TA_TA30                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->TA,30)))
#define TSB_CANA_AA_AA0                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,0)))
#define TSB_CANA_AA_AA1                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,1)))
#define TSB_CANA_AA_AA2                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,2)))
#define TSB_CANA_AA_AA3                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,3)))
#define TSB_CANA_AA_AA4                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,4)))
#define TSB_CANA_AA_AA5                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,5)))
#define TSB_CANA_AA_AA6                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,6)))
#define TSB_CANA_AA_AA7                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,7)))
#define TSB_CANA_AA_AA8                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,8)))
#define TSB_CANA_AA_AA9                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,9)))
#define TSB_CANA_AA_AA10                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,10)))
#define TSB_CANA_AA_AA11                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,11)))
#define TSB_CANA_AA_AA12                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,12)))
#define TSB_CANA_AA_AA13                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,13)))
#define TSB_CANA_AA_AA14                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,14)))
#define TSB_CANA_AA_AA15                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,15)))
#define TSB_CANA_AA_AA16                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,16)))
#define TSB_CANA_AA_AA17                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,17)))
#define TSB_CANA_AA_AA18                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,18)))
#define TSB_CANA_AA_AA19                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,19)))
#define TSB_CANA_AA_AA20                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,20)))
#define TSB_CANA_AA_AA21                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,21)))
#define TSB_CANA_AA_AA22                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,22)))
#define TSB_CANA_AA_AA23                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,23)))
#define TSB_CANA_AA_AA24                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,24)))
#define TSB_CANA_AA_AA25                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,25)))
#define TSB_CANA_AA_AA26                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,26)))
#define TSB_CANA_AA_AA27                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,27)))
#define TSB_CANA_AA_AA28                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,28)))
#define TSB_CANA_AA_AA29                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,29)))
#define TSB_CANA_AA_AA30                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->AA,30)))
#define TSB_CANA_RMP_RMP0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,0)))
#define TSB_CANA_RMP_RMP1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,1)))
#define TSB_CANA_RMP_RMP2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,2)))
#define TSB_CANA_RMP_RMP3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,3)))
#define TSB_CANA_RMP_RMP4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,4)))
#define TSB_CANA_RMP_RMP5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,5)))
#define TSB_CANA_RMP_RMP6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,6)))
#define TSB_CANA_RMP_RMP7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,7)))
#define TSB_CANA_RMP_RMP8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,8)))
#define TSB_CANA_RMP_RMP9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,9)))
#define TSB_CANA_RMP_RMP10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,10)))
#define TSB_CANA_RMP_RMP11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,11)))
#define TSB_CANA_RMP_RMP12                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,12)))
#define TSB_CANA_RMP_RMP13                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,13)))
#define TSB_CANA_RMP_RMP14                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,14)))
#define TSB_CANA_RMP_RMP15                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,15)))
#define TSB_CANA_RMP_RMP16                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,16)))
#define TSB_CANA_RMP_RMP17                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,17)))
#define TSB_CANA_RMP_RMP18                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,18)))
#define TSB_CANA_RMP_RMP19                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,19)))
#define TSB_CANA_RMP_RMP20                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,20)))
#define TSB_CANA_RMP_RMP21                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,21)))
#define TSB_CANA_RMP_RMP22                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,22)))
#define TSB_CANA_RMP_RMP23                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,23)))
#define TSB_CANA_RMP_RMP24                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,24)))
#define TSB_CANA_RMP_RMP25                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,25)))
#define TSB_CANA_RMP_RMP26                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,26)))
#define TSB_CANA_RMP_RMP27                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,27)))
#define TSB_CANA_RMP_RMP28                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,28)))
#define TSB_CANA_RMP_RMP29                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,29)))
#define TSB_CANA_RMP_RMP30                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,30)))
#define TSB_CANA_RMP_RMP31                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RMP,31)))
#define TSB_CANA_RML_RML0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,0)))
#define TSB_CANA_RML_RML1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,1)))
#define TSB_CANA_RML_RML2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,2)))
#define TSB_CANA_RML_RML3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,3)))
#define TSB_CANA_RML_RML4                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,4)))
#define TSB_CANA_RML_RML5                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,5)))
#define TSB_CANA_RML_RML6                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,6)))
#define TSB_CANA_RML_RML7                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,7)))
#define TSB_CANA_RML_RML8                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,8)))
#define TSB_CANA_RML_RML9                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,9)))
#define TSB_CANA_RML_RML10                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,10)))
#define TSB_CANA_RML_RML11                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CANA->RML,11)))
